conf/src/Documents/ЭП_СписаниеОприходованиеТовара/ЭП_СписаниеОприходованиеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_СписаниеОприходованиеТовара</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ЭП_ОстаткиПоОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиПоОрганизацииРН</registerRecords>
  <registerRecords>InformationRegister.ЭП_СтоимостьНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСотрудниках</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.ЭП_ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОприходованиеСписание</name>
    <type>
      <types>EnumRef.ЭП_ОприходованиеСписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_ОстаткиПоОрганизацииРН/ЭП_ОстаткиПоОрганизацииРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиПоОрганизацииРН</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_ОстаткиПоОрганизации/ЭП_ОстаткиПоОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ОстаткиПоОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_СтоимостьНоменклатуры/ЭП_СтоимостьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_СтоимостьНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Documents/ЭП_СписаниеОприходованиеТовара/Forms/ФормаПерремещенияНоменклатурыПоОрганизациям/Module.bsl
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПолучитьНоменклатуру(ОрганизацияИсточник);
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуру(ОрганизацияИсточник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиПоОрганизацииСрезПоследних.Регистратор КАК РегистраторОстаткиПоОрганизации,
		|	ЭП_СтоимостьНоменклатурыСрезПоследних.Регистратор КАК РегистраторСтоимостьНоменклатуры,
		|	ЭП_СтоимостьНоменклатурыСрезПоследних.Стоимость КАК Стоимость,
		|	ЭП_ОстаткиПоОрганизацииРН.Регистратор КАК РегистраторОстаткиПоОрганизацииРН,
		|	ЭП_ОстаткиПоОрганизацииРН.Номенклатура КАК Номенклатура,
		|	ЭП_ОстаткиПоОрганизацииРН.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиПоОрганизацииРН КАК ЭП_ОстаткиПоОрганизацииРН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ОстаткиПоОрганизации.СрезПоследних(, Организация = &Организация) КАК ЭП_ОстаткиПоОрганизацииСрезПоследних
		|		ПО ЭП_ОстаткиПоОрганизацииРН.Номенклатура = ЭП_ОстаткиПоОрганизацииСрезПоследних.Номенклатура
		|			И ЭП_ОстаткиПоОрганизацииРН.ИнвентарныйНомер = ЭП_ОстаткиПоОрганизацииСрезПоследних.ИнвентарныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_СтоимостьНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЭП_СтоимостьНоменклатурыСрезПоследних
		|		ПО ЭП_ОстаткиПоОрганизацииРН.Номенклатура = ЭП_СтоимостьНоменклатурыСрезПоследних.Номенклатура
		|			И ЭП_ОстаткиПоОрганизацииРН.ИнвентарныйНомер = ЭП_СтоимостьНоменклатурыСрезПоследних.ИнвентарныйНомер
		|ГДЕ
		|	ЭП_ОстаткиПоОрганизацииРН.Количество > 0
		|	И ЭП_ОстаткиПоОрганизацииРН.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ОрганизацияИсточник);	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда			
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Номенкклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			РегистраторОстаткиНоменклатуры = Выборка.РегистраторОстаткиПоОрганизации;
			РегистраторСтоимостьНоменклатуры = Выборка.РегистраторСтоимостьНоменклатуры;
			Стоимость = Выборка.Стоимость;
			РегистраторОстаткиНоменклатурыРН = Выборка.РегистраторОстаткиПоОрганизацииРН;	
			НовСтр = НоменклатураПоОрганизации.Добавить();
			НовСтр.Номенклатура = Номенкклатура;
			НовСтр.ИнвентарныйНомер = ИнвентарныйНомер;
			НовСтр.РегистраторОстаткиНоменклатуры = РегистраторОстаткиНоменклатуры;
			НовСтр.РегистраторОстаткиПоОрганизации = РегистраторСтоимостьНоменклатуры;
			НовСтр.Стоимость = Стоимость;
			НовСтр.РегистраторОстаткиПоОрганизацииРН = РегистраторОстаткиНоменклатурыРН;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			
		КонецЦикла;	
	Иначе 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отсутствует номенклатура к переводу на другую организацию";
		Сообщение.Сообщить();
		Возврат; 
		
	КонецЕсли;  	
	
КонецПроцедуры 

&НаСервере
Процедура ПереносНоменклатурыНаДругуюОрганизациюНаСервере()
	
	Для Каждого Элемент Из НоменклатураКПеремещению Цикл
		
		НаборСтоимостьНоменклатурыРС = РегистрыСведений.ЭП_СтоимостьНоменклатуры.СоздатьНаборЗаписей();
		НаборСтоимостьНоменклатурыРС.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиПоОрганизации); 
		НаборСтоимостьНоменклатурыРС.Прочитать();
		Запись = НаборСтоимостьНоменклатурыРС[0]; 
		
		Если Запись.Номенклатура = Элемент.Номенклатура И Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер
			И Запись.Стоимость = Элемент.Стоимость И Запись.Организация = ОрганизацияИсточник Тогда 
		   	НаборСтоимостьНоменклатурыРС.Удалить(Запись);
			НаборСтоимостьНоменклатурыРС.Записать();	
		КонецЕсли;
		
		НаборСтоимостьНоменклатурыРС = РегистрыСведений.ЭП_СтоимостьНоменклатуры.СоздатьНаборЗаписей();
		НаборСтоимостьНоменклатурыРС.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиПоОрганизации); 
        Запись = НаборСтоимостьНоменклатурыРС.Добавить();
		
		Запись.Период = ТекущаяДата(); 
		Запись.Регистратор = Элемент.РегистраторОстаткиПоОрганизации;
		Запись.Номенклатура = Элемент.Номенклатура;
		Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер;
		Запись.Стоимость = Элемент.Стоимость;  
		Запись.Организация = ОрганизацияПолучатель;
		НаборСтоимостьНоменклатурыРС.Записать();	

		НаборОстаткиПоОрагнизацииРС = РегистрыСведений.ЭП_ОстаткиПоОрганизации.СоздатьНаборЗаписей();
        НаборОстаткиПоОрагнизацииРС.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиНоменклатуры);
        НаборОстаткиПоОрагнизацииРС.Прочитать();
		Запись = НаборОстаткиПоОрагнизацииРС[0];
		
		Если Запись.Номенклатура = Элемент.Номенклатура И Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер
			И Запись.Организация = ОрганизацияИсточник Тогда 
		   	НаборОстаткиПоОрагнизацииРС.Удалить(Запись);
			НаборОстаткиПоОрагнизацииРС.Записать();	
		КонецЕсли;
		
		НаборОстаткиПоОрагнизацииРС = РегистрыСведений.ЭП_ОстаткиПоОрганизации.СоздатьНаборЗаписей();
		НаборОстаткиПоОрагнизацииРС.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиНоменклатуры); 
        Запись = НаборОстаткиПоОрагнизацииРС.Добавить();
		
		Запись.Период = ТекущаяДата(); 
		Запись.Регистратор = Элемент.РегистраторОстаткиНоменклатуры;
		Запись.Номенклатура = Элемент.Номенклатура;
		Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер; 
		Запись.Организация = ОрганизацияПолучатель;
		НаборОстаткиПоОрагнизацииРС.Записать();	

		НаборОстаткиПоОрагнизацииРН = РегистрыНакопления.ЭП_ОстаткиПоОрганизацииРН.СоздатьНаборЗаписей();
        НаборОстаткиПоОрагнизацииРН.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиПоОрганизацииРН);
        НаборОстаткиПоОрагнизацииРН.Прочитать();
		Запись = НаборОстаткиПоОрагнизацииРН[0];
		
		Если Запись.Номенклатура = Элемент.Номенклатура И Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер
			И Запись.Организация = ОрганизацияИсточник Тогда 
		   	НаборОстаткиПоОрагнизацииРН.Удалить(Запись);
			НаборОстаткиПоОрагнизацииРН.Записать();	
		КонецЕсли;
		
		НаборОстаткиПоОрагнизацииРН = РегистрыНакопления.ЭП_ОстаткиПоОрганизацииРН.СоздатьНаборЗаписей();
		НаборОстаткиПоОрагнизацииРН.Отбор.Регистратор.Установить(Элемент.РегистраторОстаткиПоОрганизацииРН); 
        Запись = НаборОстаткиПоОрагнизацииРН.Добавить();
		
		Запись.Период = ТекущаяДата(); 
		Запись.Регистратор = Элемент.РегистраторОстаткиПоОрганизацииРН; 
		Запись.Номенклатура = Элемент.Номенклатура;
		Запись.ИнвентарныйНомер = Элемент.ИнвентарныйНомер; 
		Запись.Организация = ОрганизацияПолучатель; 
		Запись.Количество = 1;
		НаборОстаткиПоОрагнизацииРН.Записать();	
		
	КонецЦикла;
	
		НоменклатураКПеремещению.Очистить();
		НоменклатураПоОрганизации.Очистить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПереносНоменклатурыНаДругуюОрганизацию(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда 		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить поля организаций";
		Сообщение.Сообщить(); 	
		Возврат;
	КонецЕсли; 
	
	Если ОрганизацияИсточник = ОрганизацияПолучатель Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя переносить номенклатуру на ту же самую организацию";
		Сообщение.Сообщить();		
	Иначе		
		ПереносНоменклатурыНаДругуюОрганизациюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураПоОрганизации.ТекущиеДанные; 
	НайденныеСтроки = НоменклатураКПеремещению.НайтиСтроки(Новый Структура("Номенклатура", СтрокаВыбора.ИнвентарныйНомер));
	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Строка = НоменклатураКПеремещению.Добавить();
		Строка.Номенклатура = СтрокаВыбора.Номенклатура;
		Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер;
		Строка.РегистраторОстаткиНоменклатуры = СтрокаВыбора.РегистраторОстаткиНоменклатуры;
		Строка.РегистраторОстаткиПоОрганизации = СтрокаВыбора.РегистраторОстаткиПоОрганизации;
		Строка.Стоимость = СтрокаВыбора.Стоимость; 
		Строка.РегистраторОстаткиПоОрганизацииРН = СтрокаВыбора.РегистраторОстаткиПоОрганизацииРН;
			
		Для Каждого Строка Из НоменклатураКПеремещению Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер Тогда 
				НоменклатураПоОрганизации.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла; 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКПеремещениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураКПеремещению.ТекущиеДанные; 
	НайденныеСтроки = НоменклатураПоОрганизации.НайтиСтроки(Новый Структура("Номенклатура", СтрокаВыбора.ИнвентарныйНомер));
	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Строка = НоменклатураПоОрганизации.Добавить();
		Строка.Номенклатура = СтрокаВыбора.Номенклатура;
		Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер;
		Строка.РегистраторОстаткиНоменклатуры = СтрокаВыбора.РегистраторОстаткиНоменклатуры;
		Строка.РегистраторОстаткиПоОрганизации = СтрокаВыбора.РегистраторОстаткиПоОрганизации;
		Строка.Стоимость = СтрокаВыбора.Стоимость;
		Строка.РегистраторОстаткиПоОрганизацииРН = СтрокаВыбора.РегистраторОстаткиПоОрганизацииРН;
	
		Для Каждого Строка Из НоменклатураПоОрганизации Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер Тогда 
				НоменклатураКПеремещению.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла; 		
	КонецЕсли; 
	
КонецПроцедуры
